import { Link } from 'react-router-dom';
import ButtonDetail from '../components/button-detail'; 
import Footer from '../components/Footer';
export default function Home() {
  return (
    <div className="">
    <div className=" header-home">
      <div className="container">
<div className="header-home-wrap">


    
      <svg  viewBox="0 0 55 17" fill="none" xmlns="http://www.w3.org/2000/svg" 
      className='strelka-home'>
  <path d="M0 16.8798V0.0480898H1.67907L11.6854 13.5375V0.0480898H13.4326V16.8798H12.0031L1.74715 3.07779V16.8798H0ZM17.9261 16.8798V0.0480898H29.4073V1.77935H19.7186V7.52617H28.3863V9.25743H19.7186V15.1485H29.5208V16.8798H17.9261ZM37.5739 17L31.9015 0.0480898H33.8527L38.3908 14.0665L42.7473 0H44.2222L48.5787 14.0665L53.1167 0.0480898H55L49.3275 17H47.8072L43.4507 3.34229L39.0715 17H37.5739Z" fill="#92E7E4" />
</svg>

<svg  viewBox="0 0 334 54" fill="none" className=" logo-home" xmlns="http://www.w3.org/2000/svg">
<path d="M46.2959 29.7242V8.47856C46.2739 6.68677 47.4186 5.5 49.1137 5.5C50.8088 5.5 51.9315 6.68677 51.9315 8.47856L51.9095 28.9562C51.9095 39.1019 55.9161 43.3837 65.6463 43.3837L72.7348 43.3604C74.4299 43.3837 75.5526 44.5472 75.5526 46.3389C75.5526 48.1307 74.4299 49.3408 72.7348 49.3175H64.8317C52.9662 49.3408 46.2739 42.2667 46.2959 29.7242ZM141.748 5.84905H145.844C157.709 5.84905 164.336 12.8766 164.357 25.4424V46.7345C164.336 48.5263 163.235 49.6898 161.54 49.6898C159.845 49.6898 158.7 48.5263 158.722 46.7345L158.678 26.2336C158.7 16.0646 154.715 11.8527 145.007 11.8527H142.586C132.877 11.8527 128.848 16.0413 128.848 26.2336L128.871 46.7113C128.848 48.5263 127.747 49.6898 126.053 49.6898C124.358 49.6898 123.213 48.5263 123.235 46.7113V25.4424C123.213 12.8766 129.884 5.84905 141.748 5.84905ZM18.5141 5.84905H22.6087C33.8799 5.84905 41.1006 12.2018 41.1006 24.1625C41.1006 36.0303 33.8799 42.4994 22.6087 42.4761H14.5075C12.7905 42.4994 11.6898 41.2893 11.6898 39.4976C11.6898 37.7057 12.7905 36.5422 14.5075 36.5189L21.7723 36.5422C30.886 36.5422 35.443 32.8888 35.443 24.1625C35.443 15.4363 30.886 11.8527 21.7723 11.8527H19.3507C9.64247 11.8527 5.6139 16.0413 5.6139 26.2336L5.63591 46.7113C5.6139 48.5263 4.51319 49.6898 2.81811 49.6898C1.12303 49.6898 -0.021702 48.5263 0.000312038 46.7113V25.4424C-0.021702 12.8766 6.64856 5.84905 18.5141 5.84905ZM188.506 5.84905H192.602C204.467 5.84905 211.115 12.8766 211.115 25.4424V35.6346C211.093 37.4498 209.993 38.6599 208.298 38.6599C206.603 38.6599 205.458 37.4498 205.48 35.6346L205.436 26.2103C205.458 16.0413 201.473 11.8294 191.765 11.8294H189.344C179.635 11.8294 175.606 15.9948 175.606 26.2103V28.9329C175.606 39.1252 179.613 43.3604 189.344 43.3604H204.952C208.98 43.3604 210.389 44.4075 212.546 46.688L213.845 48.0609C215.254 49.5502 215.386 51.3652 214.175 52.6219C212.964 53.9017 211.313 53.8318 209.684 52.0867L208.254 50.5741C207.549 49.8527 206.91 49.2943 205.15 49.271H188.485C176.641 49.2943 169.971 42.2434 169.971 29.6776V25.4192C169.993 12.8766 176.641 5.84905 188.506 5.84905ZM82.0908 26.2336V28.9562C82.0908 39.1485 86.0974 43.3837 95.8276 43.3837H98.2491C107.957 43.3837 111.92 39.1485 111.92 28.9562V26.2336C111.92 16.0413 107.957 11.8527 98.2491 11.8527H95.8276C86.1193 11.8527 82.0908 16.0181 82.0908 26.2336ZM94.991 5.84905H99.0856C110.951 5.84905 117.599 12.8766 117.599 25.4424V29.7009C117.599 42.2667 110.951 49.2943 99.0856 49.2943H94.991C83.1255 49.2943 76.4772 42.2667 76.4772 29.7009V25.4424C76.4772 12.8766 83.1475 5.84905 94.991 5.84905Z" fill="white"/>
<path d="M318.025 1.5H249.974C242.256 1.5 236 7.90451 236 15.8049V38.1951C236 46.0955 242.256 52.5 249.974 52.5H318.025C325.743 52.5 332 46.0955 332 38.1951V15.8049C332 7.90451 325.743 1.5 318.025 1.5Z" stroke="white" stroke-width="3"/>
<path d="M261.913 38.5C258.98 38.5 256.342 37.3246 254 34.9738L255.645 33.163C257.735 35.1961 259.834 36.2127 261.944 36.2127C263.527 36.2127 264.814 35.7469 265.806 34.8149C266.798 33.883 267.294 32.6865 267.294 31.2251C267.294 29.8485 266.777 28.7261 265.743 27.8577C264.73 26.9894 263.411 26.5552 261.786 26.5552C260.267 26.5552 258.716 26.9788 257.133 27.826L255.456 26.7141L256.089 15.8812H268.845V18.2003H258.273L257.798 25.3163C259.296 24.6598 260.752 24.3315 262.166 24.3315C264.382 24.3315 266.207 24.9563 267.642 26.2058C269.098 27.4341 269.826 29.0967 269.826 31.1934C269.826 33.3536 269.088 35.1115 267.61 36.4668C266.133 37.8222 264.234 38.5 261.913 38.5ZM289.777 35.1644C288.047 37.3881 285.789 38.5 283.003 38.5C280.218 38.5 277.96 37.3988 276.23 35.1961C274.52 32.9724 273.666 30.2403 273.666 27C273.666 23.802 274.531 21.0912 276.261 18.8674C278.013 16.6225 280.281 15.5 283.067 15.5C285.852 15.5 288.099 16.6119 289.809 18.8356C291.518 21.0382 292.373 23.7597 292.373 27C292.373 30.198 291.507 32.9195 289.777 35.1644ZM278.16 33.5124C279.426 35.3125 281.062 36.2127 283.067 36.2127C285.071 36.2127 286.686 35.3232 287.909 33.5442C289.155 31.7441 289.777 29.5626 289.777 27C289.777 24.4797 289.144 22.3195 287.878 20.5193C286.633 18.698 285.008 17.7873 283.003 17.7873C280.998 17.7873 279.374 18.6874 278.129 20.4876C276.884 22.2666 276.261 24.4374 276.261 27C276.261 29.5203 276.894 31.6911 278.16 33.5124ZM312.404 35.1644C310.674 37.3881 308.416 38.5 305.63 38.5C302.845 38.5 300.587 37.3988 298.856 35.1961C297.147 32.9724 296.293 30.2403 296.293 27C296.293 23.802 297.158 21.0912 298.888 18.8674C300.64 16.6225 302.908 15.5 305.694 15.5C308.479 15.5 310.726 16.6119 312.436 18.8356C314.145 21.0382 315 23.7597 315 27C315 30.198 314.134 32.9195 312.404 35.1644ZM300.787 33.5124C302.053 35.3125 303.689 36.2127 305.694 36.2127C307.698 36.2127 309.313 35.3232 310.536 33.5442C311.782 31.7441 312.404 29.5626 312.404 27C312.404 24.4797 311.771 22.3195 310.505 20.5193C309.26 18.698 307.635 17.7873 305.63 17.7873C303.625 17.7873 302.001 18.6874 300.756 20.4876C299.511 22.2666 298.888 24.4374 298.888 27C298.888 29.5203 299.521 31.6911 300.787 33.5124Z" fill="white"/>
</svg>

<div className=" home-subhead ">
  Новый стандарт <br /> одноразовых е-сигарет</div>
</div>

    <div className="flex  home__buttom-wrap">
    <button className="flex    home__buttom ">
      <a href="#" className="  home__buttom-link flex   " > 
Подробнее
      <svg viewBox="0 0 4 7" fill="none" xmlns="http://www.w3.org/2000/svg" className=' svg-home'>
<path d="M0.5 0.5L3.5 3.50003L0.5 6.5"  stroke="currentColor" strokeWidth="1.3" strokeLinecap="round" strokeLinejoin="round"/>
</svg>
      </a>
      </button>
    <button className=" "><a href="#" className="  link-buy flex   " >
Где купить
      </a></button>
    </div>

  </div>
    </div>




{/* 
    <div className=" flex  main-detail  ">
      <div className="">
  <img src="../../public/Home-logo.svg" className='main-logo'  />
<div className="main-head ">Электронная сигарета, которая умеет удивлять.</div>
<div className=" flex main-btn-wrap    ">
      <ButtonDetail />
      <div className="main__title">Скоро в продаже</div>
</div>
      </div>
<img src="/Phone-home.png" className='   main-img '/>

<div className="flex  button-detail-mob ">
      <ButtonDetail />
      <div className="detail-mob-text">Скоро в продаже</div>
</div>
    </div>
    
    <div className="flex wrap-product ">
    <div className="flex product-1">
      <img src="/public/img-plo-1.png"  />
      <div className=" contain-product">
        <img src="/logo_Plonq_400.svg" alt=""  className=" logo-400"/>
        <div className="  product-title  ">
          Одноразовое устройство  Plonq на 400 затяжек
        </div>
        <div className=" product-cost">370 ₽</div>
      <a href='#' className="flex product-link  ">
    Где купить
</a>
      </div>
    </div>


    <div className="flex wrap-product">
      <img src="../../public/img-plo-2.png"  />
      <div className="">
        <img src="../../public/logo_Plonq_500.svg" alt=""  className="logo-400 "/>
        <div className="product-title ">
          Одноразовое устройство <br /> Plonq на 500 затяжек
        </div>
        <div className=" product-cost">430 ₽</div>
    <a href='#' className="flex product-link  ">
    Где купить
</a>
      </div>
    </div>

   </div>
    <div className="flex wrap-product ">
    <div className="flex contain-product-1">
      <img src="/public/img-plo-3.png"  />
      <div className="contain-product-2">
        <img src="/public/Plonq_X.svg" alt=""  className="  img-product "/>
          <div className="product-title ">
       Стартовый набор Plonq X
        </div>
       <div className=" product-cost">430 ₽</div>
    <a href='#' className="flex product-link  ">
    Где купить
</a>

      </div>
    </div>

    <div className="flex">
      <img src="/public/img-plo-4.png"  />
      <div className="contain-product-1">
        <img src="/public/Plonq_X.svg" alt=""  className=" img-product "/>
      <div className="product-title ">
        Два сменных картриджа <br /> для устройства Plonq X
        </div>
       <div className=" product-cost">430 ₽</div>
    <a href='#' className="flex product-link  ">
    Где купить
</a>
      </div>
    </div>

   </div> 


<div class="flex-container">
  <div class="card">
    <div class="card-content">
      <div class="card-text">
        <div class="card-title">
          Об электронных <br />сигаретах
        </div>
        <div class="card-description">
          Plonq — электронный испаритель, который преобразует жидкость в пар.
        </div>
        <ButtonDetail />
      </div>
      <img src="../../public/leak-1.png" class="card-image" />
    </div>
  </div>

  <div class="card">
    <div class="card-content">
      <div class="card-text">
        <div class="card-title">
          О приложении
        </div>
        <div class="card-description">
          Plonq AI создан на основе поведенческой терапии, которая доказала свою эффективность.
        </div>
        <ButtonDetail />
      </div>
      <img src="../../public/leak-2.png" class="card-image" />
    </div>
  </div>
</div>
*/}
   <Footer /> 
    </div>
  
  );
}